app/controllers/products_controller.rb

INSERT INTO `products` (`price`, `created_at`, `title`, `image_url`, `updated_at`, `description`) VALUES(0.023, '2011-08-08 04:14:14', 'test title', 'test url.jpg', '2011-08-08 04:14:14', 'test desc')
---
  def create
    @product = Product.new(params[:product])

    respond_to do |format|
      if @product.save

SELECT * FROM `products` WHERE (`products`.`id` = 2)
UPDATE `products` SET `updated_at` = '2011-08-09 15:15:52', `description` = '<p>\r\n 				书的简介！\r\n			</p>' WHERE `id` = 2
---
  def update
    @product = Product.find(params[:id])

		puts 'debug111======================='
		@product.price = 0.02
		puts @product.price

    respond_to do |format|
      if @product.update_attributes(params[:product])